import chrome_auto_upgrade



champ_id = {
     '가렌': 86, '갈리오': 3, '갱플랭크': 41, '그라가스': 79, '그레이브즈': 104, '그웬': 887, '나르': 150, '나미': 267, '나서스': 75, '노틸러스': 111, 
     '녹턴': 56, '누누와윌럼프': 20, '니달리': 76, '니코': 518, '다리우스': 122, '다이애나': 131, '드레이븐': 119, '라이즈': 13, '라칸': 497, '람머스': 33, 
     '럭스': 99, '럼블': 68, '레나타글라스크': 888, '레넥톤': 58, '레오나': 89, '렉사이': 421, '렐': 526, '렝가': 107, '루시안': 236, '룰루': 117, '르블랑': 7, 
     '리신': 64, '리븐': 92, '리산드라': 127, '릴리아': 876, '마스터이': 11, '마오 카이': 57, '말자하': 90, '말파이트': 54, '모데카이저': 82, '모르가나': 25, 
     '문도박사': 36, '미스포츈': 21, '바드': 432, '바루스': 110, '바이': 254, '베이가': 45, '베인': 67, '벡스': 711, '벨코즈': 161, '볼리베어': 106, '브라움': 201, 
     '브랜드': 63, '블라디미르': 8, '블리츠크랭크': 53, '비에고': 234, '빅토르': 112, '뽀삐': 78, '사미라': 360, '사이온': 14, '사일러스': 517, '샤코': 35, '세나': 235, 
     '세라핀': 147, '세주아니': 113, '세트': 875, '소나': 37, '소라카': 16, '쉔': 98, '쉬바나': 102, '스웨인': 50, '스카너': 72, '시비르': 15, '신짜오': 5, '신드라': 134, 
     '신지드': 27, '쓰레쉬': 412, '아리': 103, '아무무': 32, '아우렐리온솔': 136, '아이번': 427, '아지르': 268, '아칼리': 84, '아크샨': 166, '아트록 스': 266, 
     '아펠리오스': 523, '알리스타': 12, '애니': 1, '애니비아': 34, '애쉬': 22, '야스오': 157, '에코': 245, '엘리스': 60, '오공': 62, '오른': 516, '오리아나': 61, 
     '올라프': 2, '요네': 777, '요릭': 83, '우디르': 77, '우르곳': 6, '워윅': 19, '유미': 350, '이렐리아': 39, '이블린': 28, '이즈리얼': 81, '일라오이': 420, 
     '자르반4세': 59, '자야': 498, '자 이라': 143, '자크': 154, '잔나': 40, '잭스': 24, '제드': 238, '제라스': 101, '제리': 221, '제이스': 126, '조이': 142, '직스': 115, 
     '진': 202, '질리언': 26, '징크스': 222, '초가 스': 31, '카르마': 43, '카밀': 164, '카사딘': 38, '카서스': 30, '카시오페아': 69, '카이사': 145, '카직스': 121, 
     '카타리나': 55, '칼리스타': 429, '케넨': 85, '케이틀린': 51, '케 인': 141, '케일': 10, '코그모': 96, '코르키': 42, '퀸': 133, '클레드': 240, '키아나': 246, 
     '킨드레드': 203, '타릭': 44, '탈론': 91, '탈리야': 163, '탐켄치': 223, '트런들': 48, '트리스타나': 18, '트린다미어': 23, '트위스티드페이트': 4, '트위치': 29, 
     '티모': 17, '파이크': 555, '판테온': 80, '피들스틱': 9, '피오라': 114, '피즈': 105, '하이머딩거': 74, '헤카림': 120
     }

def crawl_champ_id():
    driver = chrome_auto_upgrade.get_driver(
    show_browser=False,  # show: 웹 브라우저를 띄우지 않는 headless chrome 옵션 적용
    )
    # driver = webdriver.Chrome("chromedriver.exe", options=options)
    #driver.implicitly_wait(1)  # 로딩 완료되면 1초 기다리기
    url = f"http://fow.kr/champranking"
    driver.get(url)  
    champ_id = {}
    croll_champs = driver.find_elements_by_class_name("champ_one")
    for champ in croll_champs:
        champ_id[champ.get_attribute("rname")] = int(champ.get_attribute("cno"))
    return champ_id

if __name__=="__main__":
    crawl_champ_id()
